Terraform plan for __ibo__
<details>
<summary>Plan: 1 to add, 0 to change, 6 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_project_iam_member.label_generator_service_account_iam[0] will be destroyed
  - resource "google_project_iam_member" "label_generator_service_account_iam" {
      - etag    = "BwXVxcnKEqk=" -> null
      - id      = "ibo-prod/roles/datastore.user/serviceAccount:label-generator-file-upload@ibo-prod.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:label-generator-file-upload@ibo-prod.iam.gserviceaccount.com" -> null
      - project = "ibo-prod" -> null
      - role    = "roles/datastore.user" -> null
    }

  # google_service_account.label_generator_bucket_access_sa will be destroyed
  - resource "google_service_account" "label_generator_bucket_access_sa" {
      - account_id   = "label-generator-file-upload" -> null
      - disabled     = false -> null
      - display_name = "Service account for uploading label_generator files" -> null
      - email        = "label-generator-file-upload@ibo-prod.iam.gserviceaccount.com" -> null
      - id           = "projects/ibo-prod/serviceAccounts/label-generator-file-upload@ibo-prod.iam.gserviceaccount.com" -> null
      - name         = "projects/ibo-prod/serviceAccounts/label-generator-file-upload@ibo-prod.iam.gserviceaccount.com" -> null
      - project      = "ibo-prod" -> null
      - unique_id    = "102949753234485898985" -> null
    }

  # google_service_account_iam_member.label_generator_service_account will be destroyed
  - resource "google_service_account_iam_member" "label_generator_service_account" {
      - etag               = "BwXVxcmWdZQ=" -> null
      - id                 = "projects/ibo-prod/serviceAccounts/label-generator-file-upload@ibo-prod.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:ibo-prod.svc.id.goog[ebo/label-generator-file-upload]" -> null
      - member             = "serviceAccount:ibo-prod.svc.id.goog[ebo/label-generator-file-upload]" -> null
      - role               = "roles/iam.workloadIdentityUser" -> null
      - service_account_id = "projects/ibo-prod/serviceAccounts/label-generator-file-upload@ibo-prod.iam.gserviceaccount.com" -> null
    }

  # google_storage_bucket.label_generator_file_bucket must be replaced
-/+ resource "google_storage_bucket" "label_generator_file_bucket" {
      ~ bucket_policy_only          = true -> (known after apply)
      - default_event_based_hold    = false -> null
      ~ id                          = "*********************" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "self-edge-labels-prod" -> "shelf-edge-labels-prod" # forces replacement
      ~ project                     = "ibo-prod" -> (known after apply)
      - requester_pays              = false -> null
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/self-edge-labels-prod" -> (known after apply)
      ~ url                         = "gs://self-edge-labels-prod" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # google_storage_bucket_iam_member.label_generator_service_account_iam will be destroyed
  - resource "google_storage_bucket_iam_member" "label_generator_service_account_iam" {
      - bucket = "b/self-edge-labels-prod" -> null
      - etag   = "CAI=" -> null
      - id     = "b/self-edge-labels-prod/roles/storage.admin/serviceAccount:label-generator-file-upload@ibo-prod.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:label-generator-file-upload@ibo-prod.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.admin" -> null
    }

  # kubernetes_service_account.label_generator_service_account will be destroyed
  - resource "kubernetes_service_account" "label_generator_service_account" {
      - automount_service_account_token = true -> null
      - default_secret_name             = "label-generator-file-upload-token-nq6tl" -> null
      - id                              = "ebo/label-generator-file-upload" -> null

      - metadata {
          - annotations      = {
              - "iam.gke.io/gcp-service-account" = "label-generator-file-upload@ibo-prod.iam.gserviceaccount.com"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "label-generator-file-upload" -> null
          - namespace        = "ebo" -> null
          - resource_version = "49538920" -> null
          - uid              = "8dd60017-6046-4f59-8930-8005ef10e95a" -> null
        }
    }

Plan: 1 to add, 0 to change, 6 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #402](https://github.com/ebomart/commerce-infrastructure/actions/runs/1711516951)